# StairsDbgShowTriserCorseGeom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsDbgShowTriserCorseGeom Property
ParameterTypeId Class See Also
---
"Show Triser Corse Geometry"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsDbgShowTriserCorseGeom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsDbgShowTriserCorseGeom As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsDbgShowTriserCorseGeom {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace